def cyr2lat(a):
    letdict = {'À': 'A', 'Á': 'B', 'Â': 'V', 'Ã': 'G', 'Ä': 'D', 'Å': 'E', '¨': 'E', 'Æ': 'Zh', 'Ç': 'Z', 'È': 'I',
               'É': 'Y', 'Ê': 'K', 'Ë': 'L', 'Ì': 'M', 'Í': 'N', 'Î': 'O', 'Ï': 'P', 'Ð': 'R', 'Ñ': 'S', 'Ò': 'T',
               'Ó': 'U', 'Ô': 'F', 'Õ': 'H', 'Ö': 'Ts', '×': 'Ch', 'Ø': 'Sh', 'Ù': 'Sch', 'Ú': '', 'Û': 'Y', 'Ü': '',
               'Ý': 'E', 'Þ': 'Yu', 'ß': 'Ya', 'à': 'a', 'á': 'b', 'â': 'v', 'ã': 'g', 'ä': 'd', 'å': 'e', '¸': 'e',
               'æ': 'zh', 'ç': 'z', 'è': 'i', 'é': 'y', 'ê': 'k', 'ë': 'l', 'ì': 'm', 'í': 'n', 'î': 'o', 'ï': 'p',
               'ð': 'r', 'ñ': 's', 'ò': 't', 'ó': 'u', 'ô': 'f', 'õ': 'h', 'ö': 'ts', '÷': 'ch', 'ø': 'sh', 'ù': 'sch',
               'ú': '', 'û': 'y', 'ü': '', 'ý': 'e', 'þ': 'yu', 'ÿ': 'ya'}
    b = list(a)
    for x in b:
        pos = b.index(x)
        if letdict.get(x):
            b.remove(x)
            b.insert(pos, letdict.get(x))
    return ''.join(b)


i = input()
print(cyr2lat(i))